{
  "personalInfo": {
    "name": "Prabin Shah",
    "location": "Lalitpur, Nepal",
    "phone": "+977 9840445865",
    "email": "prabin.sc1@gmail.com",
    "role": "Software Engineer",
    "summary": "I am a dedicated Software Engineer with over 2 years of experience. I build strong, secure, and scalable applications to solve real-world problems. Using modern tech, I help businesses improve their digital presence and run more efficiently.",
    "aboutSummary": "Passionate about crafting efficient and scalable software solutions. With a strong foundation in Java and modern web technologies, I specialize in building backend systems that drive business growth. I thrive on solving complex challenges and am committed to continuous learning and delivering high-quality code."
  },
  "stats": [
    {
      "label": "Years Experience",
      "value": "2+"
    },
    {
      "label": "Projects Completed",
      "value": "15+"
    },
    {
      "label": "Client Satisfaction",
      "value": "100%"
    }
  ],
  "services": [
    {
      "title": "Backend Development",
      "description": "Secure and scalable Java applications with Spring Boot, microservices architecture, and API development.",
      "icon": "☕"
    },
    {
      "title": "Frontend Development",
      "description": "Responsive web interfaces using React.js and modern frontend technologies.",
      "icon": "💻"
    },
    {
      "title": "Database Management",
      "description": "PostgreSQL, MySQL, MongoDB optimization, and maintenance.",
      "icon": "🗄️"
    },
    {
      "title": "Cloud Solutions",
      "description": "AWS infrastructure setup, EC2, S3, Lambda, CloudFormation, and cloud-native application development.",
      "icon": "☁️"
    }
  ],
  "skills": {
    "Backend Technologies": [
      "Java",
      "Spring Boot",
      "Microservices",
      "REST APIs"
    ],
    "Frontend Technologies": [
      "React.js",
      "JavaScript",
      "HTML/CSS"
    ],
    "Databases & Tools": [
      "PostgreSQL",
      "MongoDB",
      "MySQL"
    ],
    "Cloud & DevOps": [
      "AWS",
      "Docker"
    ]
  },
  "experience": [
    {
      "company": "Coding Technology",
      "location": "Lalitpur, Nepal",
      "role": "Java Spring Training",
      "details": [
        "Enhanced expertise in Java and the Spring framework.",
        "Developed a full backend API for an Employee Management System.",
        "Designed and implemented a full backend REST APIs for a book rental system using Spring Boot, including: User authentication, book listings, and rental processing.",
        "Operated within the Scrum framework, contributing to: Sprint planning, execution, and reviews.",
        "Addressed and resolved bugs, ensuring system stability and performance.",
        "Collaborated with the frontend team to ensure seamless integration and optimal user experience.",
        "GitHub Repository: Book Rental"
      ]
    },
    {
      "company": "GenenTech",
      "location": "",
      "role": "",
      "details": [
        "Developed REST APIs for web application",
        "Resolved bugs, enhancing system stability and performance.",
        "Collaborated with the frontend team for seamless integration and user experience."
      ]
    },
    {
      "company": "Hobes Technology",
      "location": "Kathmandu, Nepal",
      "role": "Junior Backend Developer",
      "details": [
        "Book Rental System (Intern)"
      ]
    }
  ],
  "projects": [
    {
      "name": "Enterprise Multi-Tenant SaaS POS",
      "description": "A modern cloud-based Retail Point of Sale platform built for businesses operating across multiple store locations. Designed with scalability, fast checkout workflow, and real-time decision making in mind.",
      "features": [
        "Multi-Tenant Architecture: Fully isolated environment for each business.",
        "Comprehensive Dashboards: Dedicated interfaces for Cashier, Branch Manager, and Store Admin.",
        "Real-Time Inventory: Live stock tracking with low-stock alerts.",
        "Advanced Payment & Billing: Stripe integration, invoice generation, and discount logic."
      ],
      "techStack": [
        "Java",
        "Spring Boot",
        "React",
        "MySQL"
      ],
      "github": "SaaS POS"
    },
    {
      "name": "Food Delivery System",
      "description": "Food Delivery System",
      "features": [
        "Implemented secure user login and registration using JWT-based token authentication.",
        "Developed RESTful endpoints to manage cart items, place orders, and handle order history for users.",
        "Built a dynamic admin dashboard for restaurant owners to manage menu items, track orders, and update restaurant details."
      ],
      "techStack": [
        "Java",
        "Spring Boot",
        "React",
        "MongoDB"
      ],
      "github": "Himalayan Bites"
    },
    {
      "name": "Expense Tracker",
      "description": "Developed a backend-centric Expense Tracker application using Java, Spring Boot, and MySQL, designed to help users manage their personal finances.",
      "features": [
        "Secure Authentication: JWT-based login and user registration with email configuration.",
        "Financial Management: Comprehensive API for tracking income, expenses, and managing categories.",
        "Data Visualization: Dashboard API for summarizing financial data and filtering custom queries.",
        "Real-Time Alerts: Notification system for financial updates and alerts.",
        "Best Practices: Implemented JPA auditing, global exception handling, and i18n."
      ],
      "techStack": [
        "Java",
        "Spring Boot",
        "MySQL",
        "Swagger",
        "Postman"
      ],
      "github": "Expense Tracker"
    },
    {
      "name": "Smart Pharmacy Management System",
      "description": "A web application designed to streamline inventory management and ordering processes in the pharmaceutical industry, enabling efficient collaboration between stockists and local pharmacies.",
      "features": [
        "Real-Time Inventory: Accurate tracking of medicine stock levels and categories.",
        "Digital Order Placement: Direct ordering system between pharmacies and stockists.",
        "Role-Based Access: Secure portals for pharmacies, stockists, and admins."
      ],
      "techStack": [
        "Java",
        "Spring Boot",
        "Thymeleaf",
        "MySQL"
      ],
      "github": "Pharmanuman"
    },
    {
      "name": "Retail Billing Software",
      "description": "Retail Billing & POS Software",
      "features": [
        "Secure Authentication: JWT-based login with Admin and Cashier roles.",
        "Efficient Order Processing: Streamlined order placement, tax calculation, and discounts.",
        "Payment Integration: Secure online payments via Razorpay.",
        "Sales Analytics: Real-time insights on revenue and product performance."
      ],
      "techStack": [
        "Java",
        "Spring Boot",
        "React",
        "MySQL"
      ],
      "github": "Retail Billing Software"
    },
    {
      "name": "Trading Platform",
      "description": "A full-featured cryptocurrency trading platform that enables secure trading, portfolio management, and AI-driven market insights. Built for real-world usage with advanced wallet functionality and robust security.",
      "features": [
        "AI-Powered Insights: Real-time crypto queries using Gemini and CoinGecko APIs.",
        "Crypto Trading: Seamless buy/sell interface with real-time market data.",
        "Advanced Wallet: Wallet-to-wallet transfers and bank withdrawals.",
        "Robust Security: Two-Factor Authentication (2FA) and secure account recovery."
      ],
      "techStack": [
        "Java",
        "Spring Boot",
        "React",
        "MySQL"
      ],
      "github": "Trading Platform"
    }
  ],
  "education": [
    {
      "degree": "Bachelor of Software Engineering",
      "period": "2018 – 2023",
      "institution": "Nepal College of Information Technology",
      "location": "Balkumari, Lalitpur"
    }
  ]
}